# Changing the datatype of a particular column:

# Syntax:

- var['col_name'] = var['col_name'].astype(destination_type)

# Note: 

- if the column containing NAN values so we cannot directly change the datatype of the column from object to int.
- First we have to typecaste it into float,then from float into int.
- 
- ###'ISO-8859-1'= this place return 'latin-1' is also run

In [1]:
import numpy as np
import pandas as pd

In [3]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Practice/sales_data.csv',encoding='ISO-8859-1')
df.head()

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN
3,1001425,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN

In [4]:
df['Amount'] = df['Amount'].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

In [5]:
df.tail()

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
11246,1000695,Manning,P00296942,M,18-25,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,M,26-35,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,F,36-45,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,M,36-45,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,F,18-25,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

# Dropping unwanted columns:
# df = df.drp([''col1','col2'...........,'coln])

In [7]:
df=df.drop(['Gender'],axis=1)
df

,User_ID,Cust_name,Product_ID,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN
3,1001425,Sudevi,P00237842,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11246,1000695,Manning,P00296942,18-25,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,26-35,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,36-45,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,36-45,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,18-25,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

In [8]:
df=df.drop(['Age Group'],axis=1)
df

,User_ID,Cust_name,Product_ID,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN
3,1001425,Sudevi,P00237842,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
11246,1000695,Manning,P00296942,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

# Droping unwanted rows
- var = var.drop(var.Index[index_index])
- var = var.drop(var.Index['[index_index ,index_value1............]])

In [9]:
df = df.drop(df.index[[2,5,6]])
df

,User_ID,Cust_name,Product_ID,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
3,1001425,Sudevi,P00237842,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN
7,1002092,Shivangi,P00273442,61,0,Maharashtra,Western,IT Sector,Auto,1,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
11246,1000695,Manning,P00296942,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

In [10]:
df['Cust_name'].unique()

array(['Sanskriti', 'Kartik', 'Sudevi', ..., 'Chris', 'Madan Mohan',
       'Nicole'], dtype=object)

# Changing perticular data
# Syntax: 
- var['col_name'] = var['col_name'].str.replace('old_data','new_data')

In [11]:
df['Occupation'] = df['Occupation'].str.replace('Govt','GOVERMENT')
df

,User_ID,Cust_name,Product_ID,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,35,1,Andhra Pradesh,Southern,GOVERMENT,Auto,3,23934.0,NaN,NaN
3,1001425,Sudevi,P00237842,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN
7,1002092,Shivangi,P00273442,61,0,Maharashtra,Western,IT Sector,Auto,1,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
11246,1000695,Manning,P00296942,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
11247,1004089,Reichenbach,P00171342,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
11248,1001209,Oshin,P00201342,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
11249,1004023,Noonan,P00059442,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
11250,1002744,Brumley,P00281742,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

# Resetting the index

- var.reset_index(inplace=True)

In [12]:
df.reset_index(inplace=True)
df.head()

,index,User_ID,Cust_name,Product_ID,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,0,1002903,Sanskriti,P00125942,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1,1000732,Kartik,P00110942,35,1,Andhra Pradesh,Southern,GOVERMENT,Auto,3,23934.0,NaN,NaN
2,3,1001425,Sudevi,P00237842,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
3,4,1000588,Joni,P00057942,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN
4,7,1002092,Shivangi,P00273442,61,0,Maharashtra,Western,IT Sector,Auto,1,NaN,NaN,NaN

# Setting the index xisting ecolumn:
- var.set_index('col_name',inplace=True)

In [13]:
df.set_index('User_ID',inplace=True)
df

,index,Cust_name,Product_ID,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
User_ID,,,,,,,,,,,,,
1002903,0,Sanskriti,P00125942,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1000732,1,Kartik,P00110942,35,1,Andhra Pradesh,Southern,GOVERMENT,Auto,3,23934.0,NaN,NaN
1001425,3,Sudevi,P00237842,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
1000588,4,Joni,P00057942,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN
1002092,7,Shivangi,P00273442,61,0,Maharashtra,Western,IT Sector,Auto,1,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1000695,11246,Manning,P00296942,19,1,Maharashtra,Western,Chemical,Office,4,370.0,NaN,NaN
1004089,11247,Reichenbach,P00171342,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0,NaN,NaN
1001209,11248,Oshin,P00201342,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0,NaN,NaN
1004023,11249,Noonan,P00059442,37,0,Karnataka,Southern,Agriculture,Office,3,206.0,NaN,NaN
1002744,11250,Brumley,P00281742,19,0,Maharashtra,Western,Healthcare,Office,3,188.0,NaN,NaN

# New data

In [14]:
df=pd.read_csv('https://github.com/Taj1920/Data-Analysis-Datasets/raw/refs/heads/main/Datasets-Cleaning/uncleaned_appliances.csv')
df.head()

,goods-title-link--jump,goods-title-link--jump href,rank-title,rank-sub,price,discount,selling_proposition,goods-title-link
0,1pc Rechargeable Deep Tissue Muscle Handheld M...,https://us.shein.com/1pc-Rechargeable-Deep-Tis...,#1 Best Sellers,in Give Gifts,$2.03,-22%,NaN,NaN
1,1pc Portable Hanging Neck Fan,https://us.shein.com/1pc-Portable-Hanging-Neck...,#4 Best Sellers,in Top rated in Portable Fans,$6.48,-20%,NaN,NaN
2,1pc Pink Colored Curved Eyelash Curler False E...,https://us.shein.com/1pc-Pink-Colored-Curved-E...,NaN,NaN,$1.80,NaN,400+ sold recently,NaN
3,1 Mini Portable Handheld Fan With 2 Aa Batteri...,https://us.shein.com/1-Mini-Portable-Handheld-...,NaN,NaN,$0.88,-72%,5.6k+ sold recently,NaN
4,"Wit Water Flosser,Portable Oral Irrigator With...",https://us.shein.com/Wit-Water-Flosser-Portabl...,#6 Best Sellers,in Oral Irrigators,$12.06,-40%,NaN,NaN

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3986 entries, 0 to 3985
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   goods-title-link--jump       40 non-null     object
 1   goods-title-link--jump href  40 non-null     object
 2   rank-title                   559 non-null    object
 3   rank-sub                     559 non-null    object
 4   price                        3986 non-null   object
 5   discount                     2459 non-null   object
 6   selling_proposition          1361 non-null   object
 7   goods-title-link             3946 non-null   object
dtypes: object(8)
memory usage: 249.3+ KB

In [16]:
df.tail()

,goods-title-link--jump,goods-title-link--jump href,rank-title,rank-sub,price,discount,selling_proposition,goods-title-link
3981,NaN,NaN,NaN,NaN,$54.34,NaN,NaN,Unbeatablesale 142Mhz .25 Wave Kulduckie
3982,NaN,NaN,NaN,NaN,$64.06,NaN,NaN,Unbeatablesale 440-460Mhz Load And Tip Only -B...
3983,NaN,NaN,NaN,NaN,$61.99,-24%,NaN,"TaoTronics Air Fryer, 1700W 14.8 QT, 9 In 1 Ai..."
3984,NaN,NaN,NaN,NaN,$81.47,-3%,NaN,"Air Fryer 5.3 Quart, Digital Oilless Frying Co..."
3985,NaN,NaN,NaN,NaN,$501.21,-28%,NaN,Up To 350lbs Okin Motor Power Lift Recliner Ch...

In [17]:
df = df.drop(df.index[[1,2,7]])
df

,goods-title-link--jump,goods-title-link--jump href,rank-title,rank-sub,price,discount,selling_proposition,goods-title-link
0,1pc Rechargeable Deep Tissue Muscle Handheld M...,https://us.shein.com/1pc-Rechargeable-Deep-Tis...,#1 Best Sellers,in Give Gifts,$2.03,-22%,NaN,NaN
3,1 Mini Portable Handheld Fan With 2 Aa Batteri...,https://us.shein.com/1-Mini-Portable-Handheld-...,NaN,NaN,$0.88,-72%,5.6k+ sold recently,NaN
4,"Wit Water Flosser,Portable Oral Irrigator With...",https://us.shein.com/Wit-Water-Flosser-Portabl...,#6 Best Sellers,in Oral Irrigators,$12.06,-40%,NaN,NaN
5,"1pc Ice Pop Mold, Plastic Ice Cream Mold, Froz...",https://us.shein.com/1pc-Ice-Pop-Mold-Plastic-...,#10 Best Sellers,in Refrigerators & Freezers,$2.70,NaN,NaN,NaN
6,"Mini Pocket Bluetooth Thermal Printer, Portabl...",https://us.shein.com/Mini-Pocket-Bluetooth-The...,#8 Best Sellers,in Other Household Appliances,$3.50,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
3981,NaN,NaN,NaN,NaN,$54.34,NaN,NaN,Unbeatablesale 142Mhz .25 Wave Kulduckie
3982,NaN,NaN,NaN,NaN,$64.06,NaN,NaN,Unbeatablesale 440-460Mhz Load And Tip Only -B...
3983,NaN,NaN,NaN,NaN,$61.99,-24%,NaN,"TaoTronics Air Fryer, 1700W 14.8 QT, 9 In 1 Ai..."
3984,NaN,NaN,NaN,NaN,$81.47,-3%,NaN,"Air Fryer 5.3 Quart, Digital Oilless Frying Co..."
3985,NaN,NaN,NaN,NaN,$501.21,-28%,NaN,Up To 350lbs Okin Motor Power Lift Recliner Ch...

In [18]:
df=df.drop(columns=['goods-title-link--jump',
                 'goods-title-link--jump href',
                 'goods-title-link'],
        errors="ignore")
df

,rank-title,rank-sub,price,discount,selling_proposition
0,#1 Best Sellers,in Give Gifts,$2.03,-22%,NaN
3,NaN,NaN,$0.88,-72%,5.6k+ sold recently
4,#6 Best Sellers,in Oral Irrigators,$12.06,-40%,NaN
5,#10 Best Sellers,in Refrigerators & Freezers,$2.70,NaN,NaN
6,#8 Best Sellers,in Other Household Appliances,$3.50,NaN,NaN
...,...,...,...,...,...
3981,NaN,NaN,$54.34,NaN,NaN
3982,NaN,NaN,$64.06,NaN,NaN
3983,NaN,NaN,$61.99,-24%,NaN
3984,NaN,NaN,$81.47,-3%,NaN
3985,NaN,NaN,$501.21,-28%,NaN

In [19]:
df['rank-title'].unique()

array(['#1 Best Sellers', nan, '#6 Best Sellers', '#10 Best Sellers',
       '#8 Best Sellers', '#9 Best Sellers', '#5 Best Sellers',
       '#2 Best Sellers', '#7 Best Sellers', '#3 Best Sellers',
       '#4 Best Sellers'], dtype=object)

In [20]:
df['rank-title'] = df['rank-title'].str.strip('# Best Seller')
df

,rank-title,rank-sub,price,discount,selling_proposition
0,1,in Give Gifts,$2.03,-22%,NaN
3,NaN,NaN,$0.88,-72%,5.6k+ sold recently
4,6,in Oral Irrigators,$12.06,-40%,NaN
5,10,in Refrigerators & Freezers,$2.70,NaN,NaN
6,8,in Other Household Appliances,$3.50,NaN,NaN
...,...,...,...,...,...
3981,NaN,NaN,$54.34,NaN,NaN
3982,NaN,NaN,$64.06,NaN,NaN
3983,NaN,NaN,$61.99,-24%,NaN
3984,NaN,NaN,$81.47,-3%,NaN
3985,NaN,NaN,$501.21,-28%,NaN

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3983 entries, 0 to 3985
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   rank-title           558 non-null    object
 1   rank-sub             558 non-null    object
 2   price                3983 non-null   object
 3   discount             2458 non-null   object
 4   selling_proposition  1360 non-null   object
dtypes: object(5)
memory usage: 186.7+ KB

In [22]:
df['rank-title'] = df['rank-title'].astype(float)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3983 entries, 0 to 3985
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   rank-title           558 non-null    float64
 1   rank-sub             558 non-null    object
 2   price                3983 non-null   object
 3   discount             2458 non-null   object
 4   selling_proposition  1360 non-null   object
dtypes: float64(1), object(4)
memory usage: 186.7+ KB

In [23]:
avg =df['rank-title'].mean()
avg

np.float64(5.431899641577061)

In [24]:
avg =round(df['rank-title'].mean())
avg

5

In [25]:
df['rank-sub'].unique()

array(['in Give Gifts', nan, 'in Oral Irrigators',
       'in Refrigerators & Freezers', 'in Other Household Appliances',
       'in Oral Care Appliances', 'in Household Appliances',
       'in Women Shave & Hair Removal Appliances',
       'in Vacuum Food Sealers', 'in Juicer & Food Processor',
       'in Cleaning Appliance Parts', 'in Laundry Appliances',
       'in Fruit & Vegetable Tools', 'in Blenders',
       'in Kitchen Meat Grinders', 'in Egg Cookers', 'in Air Purifiers',
       'in Other Body Care Machines', 'in Hair Dryers',
       'in Electric Nose & Ear Trimmers', 'in Electric Toothbrushes',
       'in Specialty Kitchen Appliances', 'in Led Makeup Mirror',
       'in Heater & Cooler', 'in Electric Space Heater',
       'in Juicer Machines', 'in Men Shave & Hair Removal Appliances',
       'in Personal Size Blenders', 'in Kitchen Appliance Parts',
       'in Personal Care Appliance Accessories', 'in Car Vacuum Cleaner',
       'in Power Toothbrushes', 'in Curling Tongs & Curling Wands',
       'in Water Treatment Appliances', 'in Hair Styling Care Appliances',
       'in Cleaning Appliances', 'in Electric Hair Clippers',
       'in Environmental Appliances', 'in Kitchen Appliances',
       'in Hand Blenders', 'in Milk Frothers', 'in Other Styling Tools',
       'in Other Kitchen Appliances', 'in Humidifier',
       'in Major Appliances Parts', 'in Wax Heaters',
       'in Massage & Relaxation Tools',
       'in Electric Grills & Electric Griddles',
       'in Portable Refrigerator', 'in Epilators',
       'in Electronic Foot Files', 'in Coffee & Tea Appliances',
       'in Oximeter & Blood Pressure Meter', 'in Digital Kitchen Scales',
       'in Measuring Tools', 'in Hair Straightening Irons',
       'in Digital Thermometers & Timers', 'in Cooking Appliances',
       'in Electric Blade Grinders', 'in Electric Salt & Pepper Grinders',
       'in Waffle Makers', 'in Kitchen Timers',
       'in Personal Care Appliances', 'in Ultrasonic Cleaners',
       'in Refrigerators', 'in Women Electric Shavers',
       'in Food Processors', 'in Garment Steamers',
       'in Electronic Beauty Instruments', 'in Electric Lunch Boxes',
       'in Electric Kettles', 'in Personal Care Appliance',
       'in Table Fans', 'in Air Fryers', 'in Health & Wellness Monitors',
       'in Ice Crushers & Shavers', 'in Handle Fans',
       'in Massage Tools & Equipment', 'in Temperature Gauges',
       'in Electronic Nail Art Equipment', 'in Aroma Diffuser',
       'in Water and Ice Dispensers', 'in Electric Hair Brushes',
       'in Rice Cookers', 'in Electric Eyebrow Trimmer', 'in Egg Tools',
       'in Aromatherapy', 'in Summer Travel Bestsellers',
       'in Styling Tools & Appliances', 'in Car Electronics',
       'in Hot Tea Makers', 'in Meat & Poultry Tools',
       'in Electric Cleaning Brushes', 'in Dehumidifiers',
       'in Lint Removers', 'in Beauty & Body Care Appliances',
       'in Hair Clippers', 'in Exhaust Fans', 'in Home Appliances',
       'in Portable Fans', 'in Top rated in Portable Fans',
       'in Slow Cookers', 'in Kitchen Scales', 'in Hair Curling Irons',
       'in Portable Vacuums', 'in Popcorn Makers',
       'in Electric Deep Fryers', 'in Laser Hair Removal Devices',
       'in Vacuum Cleaners', 'in Ice Makers', 'in Other Coffee Makers',
       'in Air Conditioners', 'in Washers & Dryers',
       'in Stick Vacuum Cleaners', 'in Electric Shavers',
       'in Portable Washing Machines', 'in Water Filter Cartridges',
       'in Meat Grinders', 'in Electric Blankets', 'in Washing Machines',
       'in Stand Mixers', 'in Major Appliances', 'in Massage Chair',
       'in Warming Products', 'in Hot Plates'], dtype=object)

In [26]:
df['rank-sub']=df['rank-sub'].str.strip('in')
df

,rank-title,rank-sub,price,discount,selling_proposition
0,1.0,Give Gifts,$2.03,-22%,NaN
3,NaN,NaN,$0.88,-72%,5.6k+ sold recently
4,6.0,Oral Irrigators,$12.06,-40%,NaN
5,10.0,Refrigerators & Freezers,$2.70,NaN,NaN
6,8.0,Other Household Appliances,$3.50,NaN,NaN
...,...,...,...,...,...
3981,NaN,NaN,$54.34,NaN,NaN
3982,NaN,NaN,$64.06,NaN,NaN
3983,NaN,NaN,$61.99,-24%,NaN
3984,NaN,NaN,$81.47,-3%,NaN
3985,NaN,NaN,$501.21,-28%,NaN